7767517
561 657
Input                    in0                      0 1 in0
Convolution              conv_197                 1 1 in0 1 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864
Swish                    silu_11                  1 1 1 2
Convolution              conv_198                 1 1 2 3 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_12                  1 1 3 4
Convolution              conv_199                 1 1 4 5 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_13                  1 1 5 6
Slice                    tensor_split_0           1 2 6 7 8 -23300=2,32,-233 1=0
Split                    splitncnn_0              1 2 8 9 10
Convolution              conv_200                 1 1 10 11 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_14                  1 1 11 12
Split                    splitncnn_1              1 2 12 13 14
Convolution              conv_201                 1 1 14 15 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_15                  1 1 15 16
Concat                   cat_0                    4 1 7 9 13 16 17 0=0
Convolution              conv_202                 1 1 17 18 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_16                  1 1 18 19
Pooling                  avgpool2d_0              1 1 19 20 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              conv_203                 1 1 20 21 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_17                  1 1 21 22
Convolution              conv_204                 1 1 22 23 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_18                  1 1 23 24
Slice                    tensor_split_1           1 2 24 25 26 -23300=2,64,-233 1=0
Split                    splitncnn_2              1 3 26 27 28 29
Convolution              conv_205                 1 1 29 30 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_206                 1 1 28 31 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_19                  1 1 30 32
Split                    splitncnn_3              1 2 32 33 34
Swish                    silu_20                  1 1 31 35
Convolution              conv_207                 1 1 34 36 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_21                  1 1 36 37
Convolution              conv_208                 1 1 37 38 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_22                  1 1 38 39
BinaryOp                 add_0                    2 1 33 39 40 0=0
Split                    splitncnn_4              1 2 40 41 42
Convolution              conv_209                 1 1 42 43 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_23                  1 1 43 44
Convolution              conv_210                 1 1 44 45 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_24                  1 1 45 46
BinaryOp                 add_1                    2 1 41 46 47 0=0
Split                    splitncnn_5              1 2 47 48 49
Convolution              conv_211                 1 1 49 50 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_25                  1 1 50 51
Convolution              conv_212                 1 1 51 52 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_26                  1 1 52 53
BinaryOp                 add_2                    2 1 48 53 54 0=0
Concat                   cat_1                    2 1 54 35 55 0=0
Convolution              conv_213                 1 1 55 56 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_27                  1 1 56 57
Convolution              conv_214                 1 1 57 58 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_28                  1 1 58 59
Split                    splitncnn_6              1 3 59 60 61 62
Convolution              conv_215                 1 1 62 63 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_216                 1 1 61 64 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_29                  1 1 63 65
Split                    splitncnn_7              1 2 65 66 67
Swish                    silu_30                  1 1 64 68
Convolution              conv_217                 1 1 67 69 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_31                  1 1 69 70
Convolution              conv_218                 1 1 70 71 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_32                  1 1 71 72
BinaryOp                 add_3                    2 1 66 72 73 0=0
Split                    splitncnn_8              1 2 73 74 75
Convolution              conv_219                 1 1 75 76 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_33                  1 1 76 77
Convolution              conv_220                 1 1 77 78 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_34                  1 1 78 79
BinaryOp                 add_4                    2 1 74 79 80 0=0
Split                    splitncnn_9              1 2 80 81 82
Convolution              conv_221                 1 1 82 83 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_35                  1 1 83 84
Convolution              conv_222                 1 1 84 85 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_36                  1 1 85 86
BinaryOp                 add_5                    2 1 81 86 87 0=0
Concat                   cat_2                    2 1 87 68 88 0=0
Convolution              conv_223                 1 1 88 89 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_37                  1 1 89 90
Convolution              conv_224                 1 1 90 91 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_38                  1 1 91 92
Concat                   cat_3                    4 1 25 27 60 92 93 0=0
Convolution              conv_225                 1 1 93 94 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_39                  1 1 94 95
Split                    splitncnn_10             1 2 95 96 97
Pooling                  avgpool2d_1              1 1 97 98 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              conv_226                 1 1 98 99 0=192 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=221184
Swish                    silu_40                  1 1 99 100
Convolution              conv_227                 1 1 100 101 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=36864
Swish                    silu_41                  1 1 101 102
Slice                    tensor_split_2           1 2 102 103 104 -23300=2,96,-233 1=0
Split                    splitncnn_11             1 3 104 105 106 107
Convolution              conv_228                 1 1 107 108 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Convolution              conv_229                 1 1 106 109 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Swish                    silu_42                  1 1 108 110
Split                    splitncnn_12             1 2 110 111 112
Swish                    silu_43                  1 1 109 113
Convolution              conv_230                 1 1 112 114 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_44                  1 1 114 115
Convolution              conv_231                 1 1 115 116 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_45                  1 1 116 117
BinaryOp                 add_6                    2 1 111 117 118 0=0
Split                    splitncnn_13             1 2 118 119 120
Convolution              conv_232                 1 1 120 121 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_46                  1 1 121 122
Convolution              conv_233                 1 1 122 123 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_47                  1 1 123 124
BinaryOp                 add_7                    2 1 119 124 125 0=0
Split                    splitncnn_14             1 2 125 126 127
Convolution              conv_234                 1 1 127 128 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_48                  1 1 128 129
Convolution              conv_235                 1 1 129 130 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_49                  1 1 130 131
BinaryOp                 add_8                    2 1 126 131 132 0=0
Concat                   cat_4                    2 1 132 113 133 0=0
Convolution              conv_236                 1 1 133 134 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_50                  1 1 134 135
Convolution              conv_237                 1 1 135 136 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_51                  1 1 136 137
Split                    splitncnn_15             1 3 137 138 139 140
Convolution              conv_238                 1 1 140 141 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Convolution              conv_239                 1 1 139 142 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Swish                    silu_52                  1 1 141 143
Split                    splitncnn_16             1 2 143 144 145
Swish                    silu_53                  1 1 142 146
Convolution              conv_240                 1 1 145 147 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_54                  1 1 147 148
Convolution              conv_241                 1 1 148 149 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_55                  1 1 149 150
BinaryOp                 add_9                    2 1 144 150 151 0=0
Split                    splitncnn_17             1 2 151 152 153
Convolution              conv_242                 1 1 153 154 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_56                  1 1 154 155
Convolution              conv_243                 1 1 155 156 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_57                  1 1 156 157
BinaryOp                 add_10                   2 1 152 157 158 0=0
Split                    splitncnn_18             1 2 158 159 160
Convolution              conv_244                 1 1 160 161 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_58                  1 1 161 162
Convolution              conv_245                 1 1 162 163 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_59                  1 1 163 164
BinaryOp                 add_11                   2 1 159 164 165 0=0
Concat                   cat_5                    2 1 165 146 166 0=0
Convolution              conv_246                 1 1 166 167 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_60                  1 1 167 168
Convolution              conv_247                 1 1 168 169 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_61                  1 1 169 170
Concat                   cat_6                    4 1 103 105 138 170 171 0=0
Convolution              conv_248                 1 1 171 172 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_62                  1 1 172 173
Split                    splitncnn_19             1 2 173 174 175
Pooling                  avgpool2d_2              1 1 175 176 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              conv_249                 1 1 176 177 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=442368
Swish                    silu_63                  1 1 177 178
Convolution              conv_250                 1 1 178 179 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_64                  1 1 179 180
Slice                    tensor_split_3           1 2 180 181 182 -23300=2,128,-233 1=0
Split                    splitncnn_20             1 3 182 183 184 185
Convolution              conv_251                 1 1 185 186 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_252                 1 1 184 187 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_65                  1 1 186 188
Split                    splitncnn_21             1 2 188 189 190
Swish                    silu_66                  1 1 187 191
Convolution              conv_253                 1 1 190 192 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_67                  1 1 192 193
Convolution              conv_254                 1 1 193 194 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_68                  1 1 194 195
BinaryOp                 add_12                   2 1 189 195 196 0=0
Split                    splitncnn_22             1 2 196 197 198
Convolution              conv_255                 1 1 198 199 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_69                  1 1 199 200
Convolution              conv_256                 1 1 200 201 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_70                  1 1 201 202
BinaryOp                 add_13                   2 1 197 202 203 0=0
Split                    splitncnn_23             1 2 203 204 205
Convolution              conv_257                 1 1 205 206 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_71                  1 1 206 207
Convolution              conv_258                 1 1 207 208 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_72                  1 1 208 209
BinaryOp                 add_14                   2 1 204 209 210 0=0
Concat                   cat_7                    2 1 210 191 211 0=0
Convolution              conv_259                 1 1 211 212 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_73                  1 1 212 213
Convolution              conv_260                 1 1 213 214 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_74                  1 1 214 215
Split                    splitncnn_24             1 3 215 216 217 218
Convolution              conv_261                 1 1 218 219 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_262                 1 1 217 220 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_75                  1 1 219 221
Split                    splitncnn_25             1 2 221 222 223
Swish                    silu_76                  1 1 220 224
Convolution              conv_263                 1 1 223 225 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_77                  1 1 225 226
Convolution              conv_264                 1 1 226 227 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_78                  1 1 227 228
BinaryOp                 add_15                   2 1 222 228 229 0=0
Split                    splitncnn_26             1 2 229 230 231
Convolution              conv_265                 1 1 231 232 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_79                  1 1 232 233
Convolution              conv_266                 1 1 233 234 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_80                  1 1 234 235
BinaryOp                 add_16                   2 1 230 235 236 0=0
Split                    splitncnn_27             1 2 236 237 238
Convolution              conv_267                 1 1 238 239 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_81                  1 1 239 240
Convolution              conv_268                 1 1 240 241 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_82                  1 1 241 242
BinaryOp                 add_17                   2 1 237 242 243 0=0
Concat                   cat_8                    2 1 243 224 244 0=0
Convolution              conv_269                 1 1 244 245 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_83                  1 1 245 246
Convolution              conv_270                 1 1 246 247 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_84                  1 1 247 248
Concat                   cat_9                    4 1 181 183 216 248 249 0=0
Convolution              conv_271                 1 1 249 250 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_85                  1 1 250 251
Convolution              conv_272                 1 1 251 252 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_86                  1 1 252 253
Split                    splitncnn_28             1 2 253 254 255
Pooling                  maxpool2d_7              1 1 255 256 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_29             1 2 256 257 258
Pooling                  maxpool2d_8              1 1 258 259 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_30             1 2 259 260 261
Pooling                  maxpool2d_9              1 1 261 262 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_10                   4 1 254 257 260 262 263 0=0
Convolution              conv_273                 1 1 263 264 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_87                  1 1 264 265
Split                    splitncnn_31             1 2 265 266 267
Interp                   interpolate_5            1 1 267 268 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_11                   2 1 268 174 269 0=0
Convolution              conv_274                 1 1 269 270 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=86016
Swish                    silu_88                  1 1 270 271
Slice                    tensor_split_4           1 2 271 272 273 -23300=2,96,-233 1=0
Split                    splitncnn_32             1 3 273 274 275 276
Convolution              conv_275                 1 1 276 277 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Convolution              conv_276                 1 1 275 278 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Swish                    silu_89                  1 1 277 279
Split                    splitncnn_33             1 2 279 280 281
Swish                    silu_90                  1 1 278 282
Convolution              conv_277                 1 1 281 283 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_91                  1 1 283 284
Convolution              conv_278                 1 1 284 285 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_92                  1 1 285 286
BinaryOp                 add_18                   2 1 280 286 287 0=0
Split                    splitncnn_34             1 2 287 288 289
Convolution              conv_279                 1 1 289 290 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_93                  1 1 290 291
Convolution              conv_280                 1 1 291 292 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_94                  1 1 292 293
BinaryOp                 add_19                   2 1 288 293 294 0=0
Split                    splitncnn_35             1 2 294 295 296
Convolution              conv_281                 1 1 296 297 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_95                  1 1 297 298
Convolution              conv_282                 1 1 298 299 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_96                  1 1 299 300
BinaryOp                 add_20                   2 1 295 300 301 0=0
Concat                   cat_12                   2 1 301 282 302 0=0
Convolution              conv_283                 1 1 302 303 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_97                  1 1 303 304
Convolution              conv_284                 1 1 304 305 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_98                  1 1 305 306
Split                    splitncnn_36             1 3 306 307 308 309
Convolution              conv_285                 1 1 309 310 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Convolution              conv_286                 1 1 308 311 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Swish                    silu_99                  1 1 310 312
Split                    splitncnn_37             1 2 312 313 314
Swish                    silu_100                 1 1 311 315
Convolution              conv_287                 1 1 314 316 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_101                 1 1 316 317
Convolution              conv_288                 1 1 317 318 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_102                 1 1 318 319
BinaryOp                 add_21                   2 1 313 319 320 0=0
Split                    splitncnn_38             1 2 320 321 322
Convolution              conv_289                 1 1 322 323 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_103                 1 1 323 324
Convolution              conv_290                 1 1 324 325 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_104                 1 1 325 326
BinaryOp                 add_22                   2 1 321 326 327 0=0
Split                    splitncnn_39             1 2 327 328 329
Convolution              conv_291                 1 1 329 330 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_105                 1 1 330 331
Convolution              conv_292                 1 1 331 332 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_106                 1 1 332 333
BinaryOp                 add_23                   2 1 328 333 334 0=0
Concat                   cat_13                   2 1 334 315 335 0=0
Convolution              conv_293                 1 1 335 336 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_107                 1 1 336 337
Convolution              conv_294                 1 1 337 338 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_108                 1 1 338 339
Concat                   cat_14                   4 1 272 274 307 339 340 0=0
Convolution              conv_295                 1 1 340 341 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_109                 1 1 341 342
Split                    splitncnn_40             1 2 342 343 344
Interp                   interpolate_6            1 1 344 345 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_15                   2 1 345 96 346 0=0
Convolution              conv_296                 1 1 346 347 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=40960
Swish                    silu_110                 1 1 347 348
Slice                    tensor_split_5           1 2 348 349 350 -23300=2,64,-233 1=0
Split                    splitncnn_41             1 3 350 351 352 353
Convolution              conv_297                 1 1 353 354 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_298                 1 1 352 355 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_111                 1 1 354 356
Split                    splitncnn_42             1 2 356 357 358
Swish                    silu_112                 1 1 355 359
Convolution              conv_299                 1 1 358 360 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_113                 1 1 360 361
Convolution              conv_300                 1 1 361 362 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_114                 1 1 362 363
BinaryOp                 add_24                   2 1 357 363 364 0=0
Split                    splitncnn_43             1 2 364 365 366
Convolution              conv_301                 1 1 366 367 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_115                 1 1 367 368
Convolution              conv_302                 1 1 368 369 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_116                 1 1 369 370
BinaryOp                 add_25                   2 1 365 370 371 0=0
Split                    splitncnn_44             1 2 371 372 373
Convolution              conv_303                 1 1 373 374 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_117                 1 1 374 375
Convolution              conv_304                 1 1 375 376 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_118                 1 1 376 377
BinaryOp                 add_26                   2 1 372 377 378 0=0
Concat                   cat_16                   2 1 378 359 379 0=0
Convolution              conv_305                 1 1 379 380 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_119                 1 1 380 381
Convolution              conv_306                 1 1 381 382 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_120                 1 1 382 383
Split                    splitncnn_45             1 3 383 384 385 386
Convolution              conv_307                 1 1 386 387 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_308                 1 1 385 388 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_121                 1 1 387 389
Split                    splitncnn_46             1 2 389 390 391
Swish                    silu_122                 1 1 388 392
Convolution              conv_309                 1 1 391 393 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_123                 1 1 393 394
Convolution              conv_310                 1 1 394 395 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_124                 1 1 395 396
BinaryOp                 add_27                   2 1 390 396 397 0=0
Split                    splitncnn_47             1 2 397 398 399
Convolution              conv_311                 1 1 399 400 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_125                 1 1 400 401
Convolution              conv_312                 1 1 401 402 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_126                 1 1 402 403
BinaryOp                 add_28                   2 1 398 403 404 0=0
Split                    splitncnn_48             1 2 404 405 406
Convolution              conv_313                 1 1 406 407 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_127                 1 1 407 408
Convolution              conv_314                 1 1 408 409 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_128                 1 1 409 410
BinaryOp                 add_29                   2 1 405 410 411 0=0
Concat                   cat_17                   2 1 411 392 412 0=0
Convolution              conv_315                 1 1 412 413 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_129                 1 1 413 414
Convolution              conv_316                 1 1 414 415 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_130                 1 1 415 416
Concat                   cat_18                   4 1 349 351 384 416 417 0=0
Convolution              conv_317                 1 1 417 418 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_131                 1 1 418 419
Split                    splitncnn_49             1 3 419 420 421 422
Pooling                  avgpool2d_3              1 1 420 423 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              conv_318                 1 1 421 424 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
ConvolutionDepthWise     convdw_390               1 1 422 425 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Convolution              conv_319                 1 1 423 426 0=96 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=110592
Swish                    silu_132                 1 1 424 427
Swish                    silu_133                 1 1 425 428
Swish                    silu_134                 1 1 426 429
Convolution              conv_320                 1 1 427 430 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_321                 1 1 428 431 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Concat                   cat_19                   2 1 429 343 432 0=0
Convolution              conv_322                 1 1 432 433 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
Swish                    silu_135                 1 1 430 434
Swish                    silu_136                 1 1 431 435
Convolution              conv_323                 1 1 434 436 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_391               1 1 435 437 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Swish                    silu_137                 1 1 433 438
Swish                    silu_138                 1 1 437 439
Slice                    tensor_split_6           1 2 438 440 441 -23300=2,96,-233 1=0
Split                    splitncnn_50             1 3 441 442 443 444
Convolution              conv_324                 1 1 439 445 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Convolution              conv_325                 1 1 444 446 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Convolution              conv_326                 1 1 443 447 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Swish                    silu_139                 1 1 445 448
Swish                    silu_140                 1 1 446 449
Split                    splitncnn_51             1 2 449 450 451
Swish                    silu_141                 1 1 447 452
Convolution              conv_327                 1 1 448 453 0=19 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2432
Convolution              conv_328                 1 1 451 454 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Concat                   cat_20                   2 1 436 453 455 0=0
Reshape                  reshape_384              1 1 455 456 0=1600 1=83
Swish                    silu_142                 1 1 454 457
Convolution              conv_329                 1 1 457 458 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_143                 1 1 458 459
BinaryOp                 add_30                   2 1 450 459 460 0=0
Split                    splitncnn_52             1 2 460 461 462
Convolution              conv_330                 1 1 462 463 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_144                 1 1 463 464
Convolution              conv_331                 1 1 464 465 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_145                 1 1 465 466
BinaryOp                 add_31                   2 1 461 466 467 0=0
Split                    splitncnn_53             1 2 467 468 469
Convolution              conv_332                 1 1 469 470 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_146                 1 1 470 471
Convolution              conv_333                 1 1 471 472 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_147                 1 1 472 473
BinaryOp                 add_32                   2 1 468 473 474 0=0
Concat                   cat_21                   2 1 474 452 475 0=0
Convolution              conv_334                 1 1 475 476 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_148                 1 1 476 477
Convolution              conv_335                 1 1 477 478 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_149                 1 1 478 479
Split                    splitncnn_54             1 3 479 480 481 482
Convolution              conv_336                 1 1 482 483 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Convolution              conv_337                 1 1 481 484 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4608
Swish                    silu_150                 1 1 483 485
Split                    splitncnn_55             1 2 485 486 487
Swish                    silu_151                 1 1 484 488
Convolution              conv_338                 1 1 487 489 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_152                 1 1 489 490
Convolution              conv_339                 1 1 490 491 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_153                 1 1 491 492
BinaryOp                 add_33                   2 1 486 492 493 0=0
Split                    splitncnn_56             1 2 493 494 495
Convolution              conv_340                 1 1 495 496 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_154                 1 1 496 497
Convolution              conv_341                 1 1 497 498 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_155                 1 1 498 499
BinaryOp                 add_34                   2 1 494 499 500 0=0
Split                    splitncnn_57             1 2 500 501 502
Convolution              conv_342                 1 1 502 503 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_156                 1 1 503 504
Convolution              conv_343                 1 1 504 505 0=48 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=20736
Swish                    silu_157                 1 1 505 506
BinaryOp                 add_35                   2 1 501 506 507 0=0
Concat                   cat_22                   2 1 507 488 508 0=0
Convolution              conv_344                 1 1 508 509 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9216
Swish                    silu_158                 1 1 509 510
Convolution              conv_345                 1 1 510 511 0=96 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=82944
Swish                    silu_159                 1 1 511 512
Concat                   cat_23                   4 1 440 442 480 512 513 0=0
Convolution              conv_346                 1 1 513 514 0=192 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=73728
Swish                    silu_160                 1 1 514 515
Split                    splitncnn_58             1 3 515 516 517 518
Pooling                  avgpool2d_4              1 1 516 519 0=1 1=2 11=2 12=1 13=0 2=1 3=0 5=1 6=1
Convolution              conv_347                 1 1 517 520 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=110592
ConvolutionDepthWise     convdw_392               1 1 518 521 0=192 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1728 7=192
Convolution              conv_348                 1 1 519 522 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=221184
Swish                    silu_161                 1 1 520 523
Swish                    silu_162                 1 1 521 524
Swish                    silu_163                 1 1 522 525
Convolution              conv_349                 1 1 523 526 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_350                 1 1 524 527 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Concat                   cat_24                   2 1 525 266 528 0=0
Convolution              conv_351                 1 1 528 529 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_164                 1 1 526 530
Swish                    silu_165                 1 1 527 531
Convolution              conv_352                 1 1 530 532 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_393               1 1 531 533 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Swish                    silu_166                 1 1 529 534
Swish                    silu_167                 1 1 533 535
Slice                    tensor_split_7           1 2 534 536 537 -23300=2,128,-233 1=0
Split                    splitncnn_59             1 3 537 538 539 540
Convolution              conv_353                 1 1 535 541 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Convolution              conv_354                 1 1 540 542 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_355                 1 1 539 543 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_168                 1 1 541 544
Swish                    silu_169                 1 1 542 545
Split                    splitncnn_60             1 2 545 546 547
Swish                    silu_170                 1 1 543 548
Convolution              conv_356                 1 1 544 549 0=19 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2432
Convolution              conv_357                 1 1 547 550 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Concat                   cat_25                   2 1 532 549 551 0=0
Reshape                  reshape_385              1 1 551 552 0=400 1=83
Swish                    silu_171                 1 1 550 553
Convolution              conv_358                 1 1 553 554 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_172                 1 1 554 555
BinaryOp                 add_36                   2 1 546 555 556 0=0
Split                    splitncnn_61             1 2 556 557 558
Convolution              conv_359                 1 1 558 559 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_173                 1 1 559 560
Convolution              conv_360                 1 1 560 561 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_174                 1 1 561 562
BinaryOp                 add_37                   2 1 557 562 563 0=0
Split                    splitncnn_62             1 2 563 564 565
Convolution              conv_361                 1 1 565 566 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_175                 1 1 566 567
Convolution              conv_362                 1 1 567 568 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_176                 1 1 568 569
BinaryOp                 add_38                   2 1 564 569 570 0=0
Concat                   cat_26                   2 1 570 548 571 0=0
Convolution              conv_363                 1 1 571 572 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_177                 1 1 572 573
Convolution              conv_364                 1 1 573 574 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_178                 1 1 574 575
Split                    splitncnn_63             1 3 575 576 577 578
Convolution              conv_365                 1 1 578 579 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_366                 1 1 577 580 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_179                 1 1 579 581
Split                    splitncnn_64             1 2 581 582 583
Swish                    silu_180                 1 1 580 584
Convolution              conv_367                 1 1 583 585 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_181                 1 1 585 586
Convolution              conv_368                 1 1 586 587 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_182                 1 1 587 588
BinaryOp                 add_39                   2 1 582 588 589 0=0
Split                    splitncnn_65             1 2 589 590 591
Convolution              conv_369                 1 1 591 592 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_183                 1 1 592 593
Convolution              conv_370                 1 1 593 594 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_184                 1 1 594 595
BinaryOp                 add_40                   2 1 590 595 596 0=0
Split                    splitncnn_66             1 2 596 597 598
Convolution              conv_371                 1 1 598 599 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_185                 1 1 599 600
Convolution              conv_372                 1 1 600 601 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_186                 1 1 601 602
BinaryOp                 add_41                   2 1 597 602 603 0=0
Concat                   cat_27                   2 1 603 584 604 0=0
Convolution              conv_373                 1 1 604 605 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_187                 1 1 605 606
Convolution              conv_374                 1 1 606 607 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_188                 1 1 607 608
Concat                   cat_28                   4 1 536 538 576 608 609 0=0
Convolution              conv_375                 1 1 609 610 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_189                 1 1 610 611
Split                    splitncnn_67             1 2 611 612 613
Convolution              conv_376                 1 1 612 614 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
ConvolutionDepthWise     convdw_394               1 1 613 615 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_190                 1 1 614 616
Swish                    silu_191                 1 1 615 617
Convolution              conv_377                 1 1 616 618 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_378                 1 1 617 619 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_192                 1 1 618 620
Swish                    silu_193                 1 1 619 621
Convolution              conv_379                 1 1 620 622 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_395               1 1 621 623 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Swish                    silu_194                 1 1 623 624
Convolution              conv_380                 1 1 624 625 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_195                 1 1 625 626
Convolution              conv_381                 1 1 626 627 0=19 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2432
Concat                   cat_29                   2 1 622 627 628 0=0
Reshape                  reshape_386              1 1 628 629 0=100 1=83
Concat                   cat_30                   3 1 456 552 629 630 0=1
Slice                    split_0                  1 2 630 631 632 -23300=2,64,19 1=0
Reshape                  reshape_387              1 1 631 633 0=2100 1=16 2=4
Sigmoid                  sigmoid_10               1 1 632 634
Permute                  permute_383              1 1 633 635 0=2
Softmax                  softmax_196              1 1 635 636 0=0 1=1
Convolution              conv_382                 1 1 636 637 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  reshape_388              1 1 637 638 0=2100 1=4
Slice                    tensor_split_8           1 2 638 639 640 -23300=2,2,-233 1=0
MemoryData               /model.22/Constant_9_output_0 0 1 641 0=2100 1=2
BinaryOp                 sub_42                   2 1 641 639 642 0=1
Split                    splitncnn_68             1 2 642 643 644
MemoryData               /model.22/Constant_10_output_0 0 1 645 0=2100 1=2
BinaryOp                 add_43                   2 1 645 640 646 0=0
Split                    splitncnn_69             1 2 646 647 648
BinaryOp                 sub_44                   2 1 647 643 649 0=1
BinaryOp                 add_45                   2 1 644 648 650 0=0
BinaryOp                 div_46                   1 1 650 651 0=3 1=1 2=2.000000e+00
Concat                   cat_31                   2 1 651 649 652 0=0
MemoryData               /model.22/Constant_12_output_0 0 1 653 0=2100
Reshape                  reshape_389              1 1 653 654 0=2100 1=1
BinaryOp                 mul_47                   2 1 652 654 655 0=2
Concat                   cat_32                   2 1 655 634 out0 0=0
