7767517
133 148
Input                    in0                      0 1 in0
Convolution              conv_52                  1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
HardSwish                hswish_19                1 1 1 2 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdwrelu_0             1 1 2 3 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=144 7=16 9=1
Split                    splitncnn_0              1 2 3 4 5
Pooling                  gap_0                    1 1 5 6 0=1 4=1
Convolution              convrelu_0               1 1 6 7 0=8 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128 9=1
Convolution              conv_54                  1 1 7 8 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128
HardSigmoid              hsigmoid_10              1 1 8 9 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_94               1 1 9 10 0=1 1=1 2=-1
BinaryOp                 mul_0                    2 1 10 4 11 0=2
Convolution              conv_55                  1 1 11 12 0=16 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=256
Convolution              convrelu_1               1 1 12 13 0=72 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1152 9=1
ConvolutionDepthWise     convdwrelu_1             1 1 13 14 0=72 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=648 7=72 9=1
Convolution              conv_57                  1 1 14 15 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1728
Split                    splitncnn_1              1 2 15 16 17
Convolution              convrelu_2               1 1 17 18 0=88 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2112 9=1
ConvolutionDepthWise     convdwrelu_2             1 1 18 19 0=88 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=792 7=88 9=1
Convolution              conv_59                  1 1 19 20 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2112
BinaryOp                 add_1                    2 1 20 16 21 0=0
Convolution              conv_60                  1 1 21 22 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSwish                hswish_20                1 1 22 23 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_108               1 1 23 24 0=96 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=2400 7=96
HardSwish                hswish_21                1 1 24 25 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_2              1 2 25 26 27
Pooling                  gap_1                    1 1 27 28 0=1 4=1
Convolution              convrelu_3               1 1 28 29 0=24 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304 9=1
Convolution              conv_62                  1 1 29 30 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2304
HardSigmoid              hsigmoid_11              1 1 30 31 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_95               1 1 31 32 0=1 1=1 2=-1
BinaryOp                 mul_2                    2 1 32 26 33 0=2
Convolution              conv_63                  1 1 33 34 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840
Split                    splitncnn_3              1 2 34 35 36
Convolution              conv_64                  1 1 36 37 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600
HardSwish                hswish_22                1 1 37 38 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_109               1 1 38 39 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6000 7=240
HardSwish                hswish_23                1 1 39 40 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_4              1 2 40 41 42
Pooling                  gap_2                    1 1 42 43 0=1 4=1
Convolution              convrelu_4               1 1 43 44 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360 9=1
Convolution              conv_66                  1 1 44 45 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360
HardSigmoid              hsigmoid_12              1 1 45 46 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_96               1 1 46 47 0=1 1=1 2=-1
BinaryOp                 mul_3                    2 1 47 41 48 0=2
Convolution              conv_67                  1 1 48 49 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600
BinaryOp                 add_4                    2 1 49 35 50 0=0
Split                    splitncnn_5              1 2 50 51 52
Convolution              conv_68                  1 1 52 53 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600
HardSwish                hswish_24                1 1 53 54 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_110               1 1 54 55 0=240 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=6000 7=240
HardSwish                hswish_25                1 1 55 56 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_6              1 2 56 57 58
Pooling                  gap_3                    1 1 58 59 0=1 4=1
Convolution              convrelu_5               1 1 59 60 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360 9=1
Convolution              conv_70                  1 1 60 61 0=240 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=15360
HardSigmoid              hsigmoid_13              1 1 61 62 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_97               1 1 62 63 0=1 1=1 2=-1
BinaryOp                 mul_5                    2 1 63 57 64 0=2
Convolution              conv_71                  1 1 64 65 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=9600
BinaryOp                 add_6                    2 1 65 51 66 0=0
Convolution              conv_72                  1 1 66 67 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4800
HardSwish                hswish_26                1 1 67 68 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_111               1 1 68 69 0=120 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3000 7=120
HardSwish                hswish_27                1 1 69 70 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_7              1 2 70 71 72
Pooling                  gap_4                    1 1 72 73 0=1 4=1
Convolution              convrelu_6               1 1 73 74 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840 9=1
Convolution              conv_74                  1 1 74 75 0=120 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3840
HardSigmoid              hsigmoid_14              1 1 75 76 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_98               1 1 76 77 0=1 1=1 2=-1
BinaryOp                 mul_7                    2 1 77 71 78 0=2
Convolution              conv_75                  1 1 78 79 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=5760
Split                    splitncnn_8              1 2 79 80 81
Convolution              conv_76                  1 1 81 82 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6912
HardSwish                hswish_28                1 1 82 83 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_112               1 1 83 84 0=144 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=3600 7=144
HardSwish                hswish_29                1 1 84 85 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_9              1 2 85 86 87
Pooling                  gap_5                    1 1 87 88 0=1 4=1
Convolution              convrelu_7               1 1 88 89 0=40 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=5760 9=1
Convolution              conv_78                  1 1 89 90 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=5760
HardSigmoid              hsigmoid_15              1 1 90 91 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_99               1 1 91 92 0=1 1=1 2=-1
BinaryOp                 mul_8                    2 1 92 86 93 0=2
Convolution              conv_79                  1 1 93 94 0=48 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6912
BinaryOp                 add_9                    2 1 94 80 95 0=0
Convolution              conv_80                  1 1 95 96 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=13824
HardSwish                hswish_30                1 1 96 97 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_113               1 1 97 98 0=288 1=5 11=5 12=1 13=2 14=2 2=1 3=2 4=2 5=1 6=7200 7=288
HardSwish                hswish_31                1 1 98 99 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_10             1 2 99 100 101
Pooling                  gap_6                    1 1 101 102 0=1 4=1
Convolution              convrelu_8               1 1 102 103 0=72 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=20736 9=1
Convolution              conv_82                  1 1 103 104 0=288 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=20736
HardSigmoid              hsigmoid_16              1 1 104 105 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_100              1 1 105 106 0=1 1=1 2=-1
BinaryOp                 mul_10                   2 1 106 100 107 0=2
Convolution              conv_83                  1 1 107 108 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=27648
Split                    splitncnn_11             1 2 108 109 110
Convolution              conv_84                  1 1 110 111 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
HardSwish                hswish_32                1 1 111 112 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_114               1 1 112 113 0=576 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=14400 7=576
HardSwish                hswish_33                1 1 113 114 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_12             1 2 114 115 116
Pooling                  gap_7                    1 1 116 117 0=1 4=1
Convolution              convrelu_9               1 1 117 118 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944 9=1
Convolution              conv_86                  1 1 118 119 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944
HardSigmoid              hsigmoid_17              1 1 119 120 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_101              1 1 120 121 0=1 1=1 2=-1
BinaryOp                 mul_11                   2 1 121 115 122 0=2
Convolution              conv_87                  1 1 122 123 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
BinaryOp                 add_12                   2 1 123 109 124 0=0
Split                    splitncnn_13             1 2 124 125 126
Convolution              conv_88                  1 1 126 127 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
HardSwish                hswish_34                1 1 127 128 0=1.666667e-01 1=5.000000e-01
ConvolutionDepthWise     convdw_115               1 1 128 129 0=576 1=5 11=5 12=1 13=1 14=2 2=1 3=1 4=2 5=1 6=14400 7=576
HardSwish                hswish_35                1 1 129 130 0=1.666667e-01 1=5.000000e-01
Split                    splitncnn_14             1 2 130 131 132
Pooling                  gap_8                    1 1 132 133 0=1 4=1
Convolution              convrelu_10              1 1 133 134 0=144 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944 9=1
Convolution              conv_90                  1 1 134 135 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=82944
HardSigmoid              hsigmoid_18              1 1 135 136 0=1.666667e-01 1=5.000000e-01
Reshape                  reshape_102              1 1 136 137 0=1 1=1 2=-1
BinaryOp                 mul_13                   2 1 137 131 138 0=2
Convolution              conv_91                  1 1 138 139 0=96 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
BinaryOp                 add_14                   2 1 139 125 140 0=0
Convolution              conv_92                  1 1 140 141 0=576 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=55296
HardSwish                hswish_36                1 1 141 142 0=1.666667e-01 1=5.000000e-01
Pooling                  gap_9                    1 1 142 143 0=1 4=1
Reshape                  reshape_103              1 1 143 144 0=1 1=1 2=-1
Flatten                  flatten_104              1 1 144 145
InnerProduct             linear_93                1 1 145 146 0=3 1=1 2=1728
Softmax                  softmax_51               1 1 146 out0 0=0 1=1
